Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: The following options are available:
it_it: Sono disponibili le seguenti opzioni:

source: The following options can be chosen here:
it_it: Qui è possibile scegliere le seguenti opzioni:

source: The following options can be set:
it_it: È possibile impostare le seguenti opzioni:

source: The following sections describe how the PI tuning tool would work for torque, velocity and position mode.
it_it: Le sezioni seguenti descrivono il funzionamento dello strumento di ottimizzazione PI per le modalità "torque" [coppia], velocità e posizione.

source: The following settings can be made here:
it_it: Qui è possibile effettuare le seguenti impostazioni:

source: The following settings can be made:
it_it: È possibile effettuare le seguenti impostazioni:

source: The following takes ESP32-S3-LCD-1.47-Demo as an example to introduce the two opening methods of the project and the general steps of use, and the detailed explanation of the ESP-IDF project.
it_it: Quanto segue prende come esempio la ESP32-S3-LCD-1.47-Demo per introdurre i due metodi di apertura del progetto, le fasi generali di utilizzo e la spiegazione dettagliata del progetto ESP-IDF.

source: The form used for labels is:
it_it: Il formato utilizzato per le etichette è:

source: The generated DCF file can then be used either with the import functions of this tool or with the Device Configuration tool or also with configuration tools from other vendors.
it_it: Il file DCF generato può quindi essere utilizzato con le funzioni di importazione di questo strumento o col tool Device Configuration o anche con strumenti di configurazione di altri fornitori.

source: The generated code can then for example be taken over into the TMCL Creator.
it_it: Il codice generato può quindi essere trasferito, ad esempio, in TMCL Creator.

source: The green bar in the StallGuard Adjuster displays the actual load value.
it_it: La barra verde nello StallGuard Adjuster mostra il valore di carico effettivo.

source: The homing attained flag of the status word is also shown here.
it_it: Qui viene visualizzato anche il flag di homing raggiunto della parola di stato.

source: The hysteresis is also being shown as a blue bar on the right hand side of the graph.
it_it: L'isteresi viene visualizzata anche come una barra blu sul lato destro del grafico.

source: The installation provides CH341PAR and CH343SER (driver demo), and you can view the serial port and corresponding ports through the device manager.
it_it: L'installazione fornisce CH341PAR e CH343SER (driver demo) ed è possibile visualizzare la porta seriale e le porte corrispondenti tramite "device manager" [Gestione dispositivi].

source: The language used by the TMCL/PC host is very similar to TMCL, but as the program is being executed on the PC it is called TMCL/PC.
it_it: Il linguaggio utilizzato dall'host TMCL/PC è molto simile a TMCL, ma poiché il programma viene eseguito sul PC, viene chiamato TMCL/PC.

source: The latter can be done by clicking the Emergency Stop button.
it_it: Quest'ultimo arresto può essere eseguito cliccando sul pulsante "Emergency Stop".

source: The left input field can only be used to enter decimal numbers, whereas the right input field serves for entering hexadecimal numbers (preceded by “0x” like in C language) or decimal numbers.
it_it: Il campo di input sinistro può essere utilizzato solo per inserire numeri decimali, mentre quello destro serve per inserire numeri esadecimali (preceduti da “0x” come nel linguaggio C) o numeri decimali.

source: The link to the board website provided here can only work correctly when the EDS file also contains the correct board website URL (which often is not the case).
it_it: Il link al sito web del consiglio fornito qui può funzionare correttamente solo se il file EDS contiene anche l'URL corretto del sito web del consiglio (il che spesso non accade).

source: The list in the middle section of the tab contains all TMCL parameters that are regularly polled.
it_it: L'elenco nella sezione centrale della scheda contiene tutti i parametri TMCL che vengono regolarmente interrogati.

source: The lower area of the RPDO tab presents two lists: one on the left side that shows all objects that are currently mapped to the selected RPDO (Mapped objects) and one that shows all objects that can be mapped to RPDOs (Mappable objects).
it_it: L'area inferiore del tab RPDO presenta due elenchi: uno sul lato sinistro che mostra tutti gli oggetti attualmente mappati all'RPDO selezionato (Mapped objects) e uno che mostra tutti gli oggetti che possono essere mappati agli RPDO (Mappable objects).

source: The lower area of the TPDO tab presents two lists: one on the left side that shows all objects that are currently mapped to the selected TPDO (Mapped objects) and one that shows all objects that can be mapped to TPDOs (Mappable objects).
it_it: L'area inferiore della scheda TPDO presenta due elenchi: uno sul lato sinistro che mostra tutti gli oggetti attualmente mappati sul TPDO selezionato (Mapped objects) e uno che mostra tutti gli oggetti che possono essere mappati sui TPDO (Mappable objects).

source: The lowest possible value depends on the selected baud rate.
it_it: Il valore più basso possibile dipende dalla velocità in baud selezionata.

source: The lowest possible value depends on the selected bit rate.
it_it: Il valore più basso possibile dipende dal bit rate selezionato.

source: The main settings that can be made here are the motor run current and standby current, the functionality of the limit switches and the micro step resolution.
it_it: Le impostazioni principali che possono essere effettuate qui sono la corrente di funzionamento e di standby del motore, la funzionalità dei finecorsa e la risoluzione dei micropassi.

source: The main window contains the following parts:
it_it: La finestra principale contiene le seguenti parti:

source: The menu bar is placed at the top of the main window, the status bar is placed to the bottom.
it_it: La barra dei menu è posizionata nella parte superiore della finestra principale, la barra di stato è posizionata in basso.

source: The menu commands are sorted in five entries:
it_it: I comandi del menù sono ordinati in cinque voci:

source: The module index parameter is the last parameter of the command.
it_it: Il parametro Indice Modulo è l'ultimo parametro del comando.

source: The module indices are defined using the #module directive.
it_it: Gli indici del modulo vengono definiti utilizzando la direttiva #module.

source: The module indices must be defined using the #module directive.
it_it: Gli indici dei moduli devono essere definiti utilizzando la direttiva #module.

source: The motor continues running in negative direction until clicking the stop button or a different button for running the motor.
it_it: Il motore continua a girare in direzione negativa finché non si preme il pulsante di arresto o un pulsante diverso per azionare il motore.

source: The motor continues running in positive direction until clicking the stop button or a different button for running the motor.
it_it: Il motore continua a girare in direzione positiva finché non si preme il pulsante di arresto o un altro pulsante per far girare il motore.

source: The motor continuous running in negative direction until clicking the stop button or a different button for running the motor.
it_it: Il motore continua a girare in direzione negativa finché non si preme il pulsante di arresto o un pulsante diverso per azionare il motore.

source: The motor continuous running in positive direction until clicking the stop button or a different button for running the motor.
it_it: Il motore continua a girare in direzione positiva finché non si preme il pulsante di arresto o un pulsante diverso per azionare il motore.

source: The motor runs in negative direction as long as the button is being pressed.
it_it: Il motore gira in direzione negativa finché il pulsante viene premuto.

source: The motor runs in positive direction as long as the button is being pressed.
it_it: Il motore gira in direzione positiva finché il pulsante viene premuto.

source: The motor will be stopped automatically if the load value reaches this value.
it_it: Il motore si arresterà automaticamente se il valore di carico raggiunge questo valore.

source: The name of that file must be given after the #include directive.
it_it: Il nome del file deve essere specificato dopo la direttiva #include.

source: The names can be put into double quotes.
it_it: I nomi possono essere racchiusi tra virgolette doppie.

source: The necessary settings are also displayed as TMCL commands in the TMCL area of the StallGuard Adjuster window.
it_it: Le impostazioni necessarie vengono visualizzate anche come comandi TMCL nell'area TMCL della finestra StallGuard Adjuster.

source: The new bitrate will be set but will not be activated on the device.
it_it: Il nuovo bitrate verrà impostato ma non verrà attivato sul dispositivo.

source: The new setting will not be activated, nor will the bit rate used by the TMCL-IDE be changed.
it_it: La nuova impostazione non verrà attivata, né il bitrate utilizzato da TMCL-IDE verrà modificato.

source: The new value will be sent to the module after leaving the editor of this parameter.
it_it: Il nuovo valore verrà inviato al modulo dopo aver abbandonato l'editor di questo parametro.

source: The node ID of that device will then be changed (but the setting will not be stored permanently in the device).
it_it: L'ID nodo di quel dispositivo verrà quindi modificato (ma l'impostazione non verrà memorizzata in modo permanente nel dispositivo).

source: The numerical value will also take that color.
it_it: Anche il valore numerico assumerà quel colore.

source: The object browser also shows some information about the selected object:
it_it: L'object browser mostra anche alcune informazioni sull'oggetto selezionato:

source: The object browser is the main tool for reading and writing CANopen objects via SDO.
it_it: L'object browser è lo strumento principale per la lettura e la scrittura di oggetti CANopen tramite SDO.

source: The object will then appear also on the list of mapped objects.
it_it: L'oggetto apparirà quindi anche nell'elenco degli oggetti mappati.

source: The only difference is that it works with CANopen objects instead of TMCL parameters.
it_it: L'unica differenza è che funziona con oggetti CANopen anziché con parametri TMCL.

source: The overall goal is to build an LVGL-based user interface environment.
it_it: L'obiettivo generale è creare un ambiente di interfaccia utente basato su LVGL.

source: The parameter selection dialog allows selecting the parameters that are to be displayed in the graph window.
it_it: La finestra di dialogo di selezione dei parametri consente di selezionare i parametri da visualizzare nella finestra del grafico.

source: The path to install the library contains Chinese characters, resulting in the inability to find the library file
it_it: Il path per installare la libreria contiene caratteri cinesi, con conseguente impossibilità di trovare il file della libreria.

source: The phenomenon is as follows (the shooting effect is more conspicuous than the human eye observation, please turn the TF-Luna to prevent the angle from not observing it).
it_it: Il fenomeno è il seguente (l'effetto abbagliante è più importante rispetto all'osservazione dell'occhio umano, ruotare il TF-Luna per evitare che vada direttamente negli occhi).

source: The pic folder storages images and font files.
it_it: La cartella "pic" contiene immagini e file di font.

source: The pin connections are shown in the table below.
it_it: I collegamenti dei pin sono mostrati nella tabella seguente.

source: The plugin offers features such as code navigation, project management, and debugging, etc.
it_it: Il plugin offre funzionalità come la navigazione del codice, la gestione dei progetti e il debug, ecc.

source: The port to be used can be specified there.
it_it: Qui è possibile specificare la porta da utilizzare.

source: The position mode is a tool that allows driving a motor to selectable positions.
it_it: Il tool "position mode" è uno strumento che consente di azionare un motore in posizioni selezionabili.

source: The positions are always given as microsteps.
it_it: Le posizioni sono sempre espresse in microstep.

source: The process of the assembly is shown in a dialog (figure 70).
it_it: Il processo di assemblaggio è mostrato in una finestra di dialogo (figura 70).

source: The program execution will be stopped when the program reaches a breakpoint.
it_it: L'esecuzione del programma verrà interrotta quando raggiunge un breakpoint.

source: The program will be paused when running into a breakpoint or when the Pause function is selected.
it_it: Il programma verrà messo in pausa quando si raggiunge un breakpoint o quando si seleziona la funzione Pause.

source: The program will be stopped either when its end is reached or when a breakpoint is reached or when the Pause function in the Debug menu or the Pause icon is selected.
it_it: Il programma verrà interrotto al raggiungimento della fine, di un breakpoint o quando si seleziona la funzione Pause nel menù Debug o l'icona Pausa.

source: The progress of downloading the program from the module and the disassembly is shown in a special dialog.
it_it: L'avanzamento del download del programma dal modulo e del disassemblaggio viene visualizzato in una finestra di dialogo speciale.

source: The progress of the assembly is displayed in a dialog (figure 17).
it_it: L'avanzamento dell'assemblaggio viene visualizzato in una finestra di dialogo (figura 17).

source: The progress will be shown by the progress bar.
it_it: L'avanzamento verrà visualizzato dalla barra di avanzamento.

source: The purpose of CmakeLists.txt: When compiling ESP-IDF, the build tool CMake first reads the content of the top-level CMakeLists.txt in the project directory to read the build rules and identify the content to be compiled.
it_it: Scopo di CmakeLists.txt: durante la compilazione di ESP-IDF, lo strumento di compilazione CMake legge prima il contenuto del file CMakeLists.txt di primo livello nella directory del progetto per leggere le regole di compilazione e identificare il contenuto da compilare.

source: The range of the <index> and <bank> parameters is 0.
it_it: L'intervallo dei parametri <index> e <bank> è 0.

source: The range of the Y scale is automatically set so that all displayed curves will fit into the graph.
it_it: L'intervallo della scala Y viene impostato automaticamente in modo che tutte le curve visualizzate si adattino al grafico.

source: The recording ends when the end velocity has been reached.
it_it: La registrazione termina al raggiungimento della velocità finale.

source: The recording of the profile can also be aborted by clicking the Abort button.
it_it: La registrazione del profilo può anche essere interrotta cliccando sul pulsante "Abort".

source: The red line in the graph shows how the current is being lowered or raised.
it_it: La linea rossa nel grafico mostra come la corrente viene ridotta o aumentata.

source: The register browser also contains some utilities:
it_it: Il browser dei registri contiene anche alcune utilità:

source: The register browser is the most important tool for evaluating chips.
it_it: Il browser dei registri è lo strumento più importante per la valutazione dei chip.

source: The registers are grouped together into functional groups.
it_it: I registri sono raggruppati in gruppi funzionali.

source: The reply datagram will be displayed in the Answer section.
it_it: Il datagramma di risposta verrà visualizzato nella sezione Answer.

source: The reply value sent back from the module will be displayed in the Answer field.
it_it: Il valore della risposta inviata dal modulo verrà visualizzato nel campo Answer.

source: The rest (four bytes) represents the contents to be sent.
it_it: I restanti (quattro byte) rappresentano il contenuto da inviare.

source: The rest of the difference is reduced by slowly incrementing the I parameter.
it_it: La differenza rimanente viene ridotta incrementando lentamente il parametro I.

source: The rest of the line will then be ignored.
it_it: Il resto della riga verrà quindi ignorato.

source: The result is shown graphically in the StallGuard profiler window.
it_it: Il risultato viene visualizzato graficamente nella finestra del profiler StallGuard.

source: The result is written into a new editor page.
it_it: Il risultato viene scritto in una nuova pagina dell'editor.

source: The resulting TMCL datagram that represents this command can also be seen here.
it_it: Qui è possibile visualizzare anche il datagramma TMCL risultante che rappresenta questo comando.

source: The results of the GAP, GGP, GIO, GCO and SAC commands are copied into the local accumulator register.
it_it: I risultati dei comandi GAP, GGP, GIO, GCO e SAC vengono copiati nel registro accumulatore locale.

source: The same interfaces can also be used for CANopen connections.
it_it: Le stesse interfacce possono essere utilizzate anche per le connessioni CANopen.

source: The same will also be necessary when devices of other vendors are to be used with the CANopen specific tools of the TMCL-IDE.
it_it: Lo stesso sarà necessario anche quando dispositivi di altri fornitori devono essere utilizzati con gli strumenti specifici CANopen di TMCL-IDE.

source: The samples and sample rate can be changed from the settings tab on the right.
it_it: I campioni e la frequenza di campionamento possono essere modificati dal tab delle impostazioni a destra.

source: The scale on the horizontal axis is the velocity scale.
it_it: La scala sull'asse orizzontale è la scala della velocità.

source: The scale on the vertical axis shows the load value: A higher value means a higher load.
it_it: La scala sull'asse verticale mostra il valore del carico: Un valore più alto indica un carico maggiore.

source: The search progress will be shown by the progress indicator.
it_it: L'avanzamento della ricerca verrà visualizzato dall'indicatore di avanzamento.

source: The sections in this chapter describe each of these tools.
it_it: Le sezioni di questo capitolo descrivono ciascuno di questi strumenti.

source: The selected objects will be polled regularly as SDOs.
it_it: Gli oggetti selezionati verranno interrogati regolarmente come SDO.

source: The serial monitor prints the device address on the I2C bus
it_it: Il monitor seriale visualizza l'indirizzo del dispositivo sul bus I2C

source: The settings are grouped into the following tabs:
it_it: Le impostazioni sono raggruppate nei seguenti tab:

source: The software position limits can also be changed here.
it_it: Qui è anche possibile modificare i limiti di posizione software.

source: The start velocity is used at the beginning of the profile recording.
it_it: La velocità iniziale viene utilizzata all'inizio della registrazione del profilo.

source: The states of additional outputs can also be changed (if the module is equipped with additional outputs).
it_it: È anche possibile modificare gli stati delle uscite aggiuntive (se il modulo è dotato di uscite aggiuntive).

source: The status bar shows on the left side actual messages and on the right side the current TMCL command rate, which means the number of requests plus replies per second.
it_it: La barra di stato mostra sul lato sinistro i messaggi effettivi e sul lato destro la frequenza di comando TMCL corrente, ovvero il numero di richieste e risposte al secondo.

source: The step response period can be set by the Frequency setting.
it_it: Il periodo di risposta al gradino può essere settato tramite l'impostazione Frequency.

source: The steps are as follows:
it_it: I passaggi sono i seguenti:

source: The syntax is very similar to BASIC or other programming languages.
it_it: La sintassi è molto simile a quella del BASIC o di altri linguaggi di programmazione.

source: The syntax of TMCL/PC is very similar to the syntax of TMCL.
it_it: La sintassi di TMCL/PC è molto simile a quella di TMCL.

source: The target flux is changed by the Target field.
it_it: Il flusso target viene modificato tramite il campo Target.

source: The target flux is set to the desired value and the P and I values can be changed manually until the desired response is achieved.
it_it: Il flusso target viene impostato al valore desiderato e i valori P e I possono essere modificati manualmente fino a ottenere la risposta desiderata.

source: The target position is changed by the Target field.
it_it: La posizione target viene modificata tramite il campo Target.

source: The target position is set at which the tuning is to be performed.
it_it: Viene impostata la posizione target in cui deve essere eseguita la regolazione.

source: The target position is set to the desired value and the P value can be changed manually until the desired response is achieved.
it_it: La posizione target viene impostata sul valore desiderato e il valore P può essere modificato manualmente fino al raggiungimento della risposta desiderata.

source: The target velocity is changed by the Target field.
it_it: La velocità target viene modificata tramite il campo Target.

source: The target velocity is set to the desired value and the P and I values can be changed manually until the desired response is achieved.
it_it: La velocità target viene impostata al valore desiderato e i valori P e I possono essere modificati manualmente fino a ottenere la risposta desiderata.

source: The time between two SYNC commands can also be set here.
it_it: Qui è possibile impostare anche l'intervallo di tempo tra due comandi SYNC.

source: The tool provides the following functions:
it_it: Il tool fornisce le seguenti funzioni:

source: The tool then loads the DCF file and sets all object values to those loaded from the file.
it_it: Lo strumento carica quindi il file DCF e imposta tutti i valori degli oggetti su quelli caricati dal file.

source: The tool then reads all writable objects from the device and saves their contents to the DCF file.
it_it: Il tool legge quindi tutti gli oggetti scrivibili dal dispositivo e ne salva il contenuto nel file DCF.

source: The tool will indicate when the tuning is completed successfully.
it_it: Il tool indicherà quando la regolazione è stata completata correttamente.

source: The tool will then read all RPDO definitions from the device once again.
it_it: Il tool leggerà quindi nuovamente tutte le definizioni RPDO dal dispositivo.

source: The tool will then read all TPDO definitions from the device once again.
it_it: Il tool leggerà nuovamente tutte le definizioni TPDO dal dispositivo.

source: The trademark designation /symbol is also entered when the product or feature name occurs for the first time in the document.
it_it: La designazione/simbolo del marchio viene inserito anche quando il nome del prodotto o della funzionalità compare per la prima volta nel documento.

source: The tree root entries represent the families of various serial physical interfaces: USB, serial communications port, CAN and also non-physical virtual modules.
it_it: Le voci radice dell'albero rappresentano le famiglie di varie interfacce fisiche seriali: USB, porta di comunicazione seriale, CAN e anche moduli virtuali non fisici.

source: The update history shows details of the upgrade process.
it_it: La cronologia degli aggiornamenti mostra i dettagli del processo di aggiornamento.

source: The value can then be edited.
it_it: Il valore può quindi essere modificato.

source: The value of a parameter can be changed when it is writable.
it_it: Il valore di un parametro può essere modificato quando è scrivibile.
